/**
  *****************************************************************************
  * @file    zf_assert.c
  * @author  Zorb
  * @version V1.0.0
  * @date    2018-06-28
  * @brief   断言的实现
  *****************************************************************************
  * @history
  *
  * 1. Date:2018-06-28
  *    Author:Zorb
  *    Modification:建立文件
  *
  *****************************************************************************
  */

#include "zf_assert.h"
#include "zf_debug.h"

/******************************************************************************
 * 描述  ：断言产生时的处理
 * 参数  ：(in)-pFileName 文件名
 *         (in)-line 行数
 * 返回  ：无
******************************************************************************/
void ZF_assertHandle(uint8_t *pFileName, int line)
{
    ZF_DEBUG(LOG_E, "file:%s line:%d:asserted\r\n", pFileName, line);
    
    while (1);
}

/******************************** END OF FILE ********************************/
