/**
  *****************************************************************************
  * @file    zf_time.h
  * @author  Zorb
  * @version V1.0.0
  * @date    2018-06-28
  * @brief   系统时间的实现
  *****************************************************************************
  * @history
  *
  * 1. Date:2018-06-28
  *    Author:Zorb
  *    Modification:建立文件
  *
  *****************************************************************************
  */

#include "zf_time.h"
#include "zf_timer.h"
#include "zf_task.h"
#include "zf_critical.h"
#include "stdlib.h"

/* 系统滴答数 */
uint32_t ZF_tick = 0;

/******************************************************************************
 * 描述  ：获取系统滴答数
 * 参数  ：无
 * 返回  ：系统滴答数
******************************************************************************/
uint32_t ZF_getSystemTick(void)
{
    return ZF_tick;
}

/******************************************************************************
 * 描述  ：获取系统时间(ms)
 * 参数  ：无
 * 返回  ：系统时间(ms)
******************************************************************************/
uint32_t ZF_getSystemTimeMS(void)
{
    return ZF_tick * ZF_TICK_PERIOD;
}

/******************************************************************************
 * 描述  ：系统延时
 * 参数  ：(in)-tick   需要延时的系统周期数
 * 返回  ：无
******************************************************************************/
void ZF_delayTick(uint32_t tick)
{
    /* 有任务时的延时 */
    if (TASK_IS_SYSTEM_RUN() && TASK_IS_SCHEDULE_ON())
    {
        /* SR变量 */
        ZF_SR_VAL();
        
        /* 进入临界区 */
        ZF_CRITICAL_ENTER();
        
        /* 当前任务延时 */
        Task_delay(pCurrentTask, tick);
        
        /* 退出临界区 */
        ZF_CRITICAL_EXIT();
        
        /* 任务调度 */
        Task_schedule();
    }
    /* 没任务时的死延时 */
    else
    {
        uint32_t startTick = ZF_getSystemTick();
        while((ZF_getSystemTick() - startTick) < tick);
    }
}

/******************************************************************************
 * 描述  ：系统滴答程序(需挂在硬件的时间中断里边)
 * 参数  ：无
 * 返回  ：无
******************************************************************************/
void ZF_timeTick (void)
{
    /* 系统滴答计数 */
    ZF_tick++;
    
    /* 软件定时器程序 */
    Timer_process();
    
    /* 任务时间更新 */
    Task_timeUpdate();
    
    /* 任务调度 */
    Task_schedule();
}

/******************************** END OF FILE ********************************/
